app/controllers/todo_lists_controller.rb

	def index
		respond_with(@todo_lists = TodoList.all)
---
SELECT "todo_lists".* FROM "todo_lists"

  def show
    @todo_list = TodoList.find(params[:id])
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @todo_list = TodoList.new(params[:todo_list])
    if @todo_list.save
---
INSERT INTO "todo_lists" ("created_at", "description", "due_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 11 Oct 2012 16:04:17 UTC +00:00], ["description", ""], ["due_date", nil], ["title", "asass"], ["updated_at", Thu, 11 Oct 2012 16:04:17 UTC +00:00]]

  def edit
    @todo_list = TodoList.find(params[:id])
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @todo_list = TodoList.find(params[:id])
    if @todo_list.update_attributes(params[:todo_list])
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "todo_lists" SET "title" = 'asassddsss', "updated_at" = '2012-10-11 16:13:50.571729' WHERE "todo_lists"."id" = 2

  def destroy
    @todo_list = TodoList.find(params[:id])
    @todo_list.destroy
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 3]]